Revit 2024 API
BuiltInFailures.SketchFailures.CannotComputeRailingsElevation Property
 Can't compute Railings Elevation Profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotComputeRailingsElevation { get; }
Visual Basic
Public Shared ReadOnly Property CannotComputeRailingsElevation As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotComputeRailingsElevation {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace